from ABH import ABH, events
from telethon import Button
@ABH.on(events.NewMessage(pattern=r'^اوامري|اوامر$'))
async def start(event):
    global sid
    sid = event.sender_id
    buttons = [[
        Button.url(text="صنعهُ ب حب", url="https://t.me/K_4x1"),
        Button.url(text="رابط البوت", url="https://t.me/VIPABH_BOT"),        
        ]]
    await event.respond(
        """
**أوامر البوت المخفي** 卐  
⌘ `اوامر التوب`  
   يحسب عدد رسائل مجموعتك.  
⌘ `اوامر التقييد`  
   أمر مكافح للكلمات غير اللائقة بنسبة 90%.  
⌘ `اوامر الالعاب`  
   ألعاب جديدة بفكرة مميزة ولمسة إبداعية.  
⌘ `اوامر الترجمة`  
   يعمل بالرد أو مع الأمر، لكن لا تستخدمه معهما معًا.  
⌘ `اوامر الايدي`  
   **أمر مميز** يمكنك من التواصل مع الشخص عبر معرف حسابه.  
⌘ `اوامر الكشف`  
   **أمر مميز** يأخذ لقطة شاشة للرابط، وتظهر الروابط الملغمة هنا.  
⌘ `اوامر الحسبان`  
   يحسب تواريخ أشهر الصيام والعزاء، أو أي يوم من اختيارك.  
⌘ `اوامر الميمز`  
   أوامر مخصصة لإنشاء الميمز بطرق مختلفة.  
⌘ `اوامر الهمسة`  
   أمر هزلي وسري لإنشاء همسة باستخدام اليوزر أو المعرف.  
⌘ `اوامر البحث`  
   يقوم بالبحث في موقع ويكيبيديا.  
⌘ `اوامر الصوتيات`  
   يرسل لك لطمية عشوائية.                 
⌘ `اوامر الذكاء`  
   ذكاء اصطناعي مبسط ليس اذكئ شيء.
""", buttons=buttons, reply_to=event.message.id)
@ABH.on(events.NewMessage)
async def top(event):
    if event.text == "اوامر التوب":
        await event.reply('**اوامر التوب كآلاتي** \n * `توب اليومي` | `المتفاعلين` \n ل اظهار توب اكثر 10 اشخاص تفاعل \n `رسائلي` ل اظهار رسائلك من بدايه اليوم \n `رسائلة`  ل اظهار رسائل الشخص من بداية اليوم')
    elif event.text == 'اوامر التقييد':
        await event.reply('**امر التقييد كآلاتي** \n التقييد يعمل تلقائي مع البوت يعمل كلمة بذيئة او بذيئئة او بذيئ\ه \n كل انواع الكلام البذيئ ممنوع✌')
    elif event.text == 'اوامر الالعاب':
        await event.reply('**اوامر الالعاب كآلاتي** \n *امر `/num` يختار البوت رقم من 10 وانت تحزره لديك 3 محاولات \n *امر `/rings` *امر محيبس البوت يختار رقم وانت تحزره عن طريق جيب + رقم اليد ```اذا كتبت طك + رقم اليد كان فيه خاتم تخسر😁``` \n *امر `/xo` يعمل في المجموعات مع الاعبين يمكنك تحدي الاعبين بنفس التكتيك \n امر `/quist` يسأل اسئلة دينية وينتظر اجابتك ```البوت غير مناسب للبعض 😀``` \n *امر `/faster` يعمل في المجموعات وينتظر الاعبين ل اكتشاف اسرع من يكتب الكلمة التي يطلبها البوت')
    elif event.text == 'اوامر الترجمة':
        await event.reply('**اوامر الترجمة كآلاتي** \n *امر `ترجمة` \n يعمل مع الامر او بالرد ك ```ترجمة be how you are be , you are from dust```')
    elif event.text == 'اوامر الايدي':
        await event.reply('**اوامر الايدي كآلاتي** \n *امر `كشف ايدي 1910015590`\n  يعمل رابط ل حساب الايدي يمكنك من خلاله تدخل اليه')
    elif event.text == 'اوامر الكشف':
        await event.reply('**اوامر الكشف كآلاتي** \n *امر `سكرين`| `كشف رابط https://t.me/K_4x1` \n يعمل سكرين للرابط ليكشفه اذا كان ملغم ام رابط طبيعي ')
    elif event.text == 'اوامر الحسبان':
        await event.reply('**اوامر الحسبان كآلاتي** \n *امر `/dates` يحسب لك كم باقي على رجب | شعبان |رمضان | محرم او تاريخ خاص فيك')
    elif event.text == 'اوامر الميمز':
        await event.reply('**اوامر الميمز كآلاتي** \n *امر `مخفي طكة زيج` \n بالرد ليرسل بصمه زيج للرساله المردود عليها \n `هاي بعد` ارسال فيديو للتعبير عن عدم فهمك لكلام الشخص \n `ميعرف` ارسال فيديو يعبر عن فهمك لموضوع عكس الشخص المقابل \n `استرجل`')
